{
  "title": "Technical Standards and Safety Act, 2000 - Ontario Regulation 215/01 - Fuel Industry Certificates",
  "regulation_number": "215/01",
  "last_amendment": "195/19",
  "legislative_history": "184/03, 256/07, 253/08, 441/08, 441/12, 116/15, 195/19",
  "language_note": "This is the English version of a bilingual regulation",
  "contents": [
    {
      "section": "1",
      "title": "Interpretation",
      "content": "Application and requirement to comply"
    },
    {
      "section": "2", 
      "title": "Certificates",
      "content": "Expiry and renewal of certificates"
    },
    {
      "section": "3",
      "title": "Accreditation of certain training providers",
      "content": "Qualifications"
    }
  ],
  "clauses": [
    {
      "clause": "1",
      "title": "Interpretation",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "In this Regulation,",
          "definitions": [
            {
              "term": "appliance",
              "definition": "means a device that consumes or is intended to consume a gas and includes all valves, fittings, controls and components attached or to be attached to it"
            },
            {
              "term": "approved", 
              "definition": "means, with respect to an appliance or component, that the appliance or component bears the label or symbol of a designated testing organization or a label or symbol authorized by the director, certifying that it complies with a standard or laboratory test report that is listed in the document entitled \"Titles of Standards and Laboratory Test Reports Authorized in the Province of Ontario under the Act\", dated August 2002, published by the Technical Standards and Safety Authority and available through its Internet website, or that was listed in a predecessor to that document"
            },
            {
              "term": "direct supervision",
              "definition": "means the supervision provided by a supervising certificate holder who is on site in close proximity to a trainee and is available to assist and supervise the trainee"
            },
            {
              "term": "general supervision",
              "definition": "means the supervision provided by a supervising certificate holder who may or may not be on site but who is readily available to assist a trainee"
            },
            {
              "term": "record of training",
              "definition": "means a record issued by an accredited training provider that indicates training received by a person"
            },
            {
              "term": "supervising certificate holder",
              "definition": "means a person who holds a certificate under this Regulation and provides supervision to a trainee"
            }
          ]
        },
        {
          "subsection": "(2)",
          "content": "A reference in this Regulation to a director is a reference to the director to whom the subject matter of this Regulation is assigned."
        },
        {
          "subsection": "(3)", 
          "content": "A reference in this Regulation to \"director's order\" is a reference to a safety order under section 14 of the Act, a public safety order under section 31 of the Act or an authorization under clause 36 (3) (a) of the Act."
        },
        {
          "subsection": "(4)",
          "content": "The document incorporated by reference in the definition of \"approved\" in subsection (1) includes amendments made to the document from time to time after Ontario Regulation 253/08 is made."
        }
      ]
    },
    {
      "clause": "2",
      "title": "Application and requirement to comply",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "This Regulation applies with respect to certificates required to be held in order to perform work under the following regulations:",
          "regulations": [
            "Ontario Regulation 212/01 (Gaseous Fuels)",
            "Ontario Regulation 211/01 (Propane Storage and Handling)",
            "Ontario Regulation 210/01 (Oil and Gas Pipeline Systems)",
            "Ontario Regulation 213/01 (Fuel Oil)",
            "Ontario Regulation 214/01 (Compressed Gas)"
          ]
        },
        {
          "subsection": "(2)",
          "content": "Every person engaged in an activity, use of equipment, process or procedure to which the Act and this Regulation apply shall comply with the Act, this Regulation and any applicable director's order."
        },
        {
          "subsection": "(3)",
          "content": "For the purposes of subsection (1), the reference to an activity, use of equipment, process or procedure includes, but is not limited to, design, construction, erection, installation, maintenance, alteration, service, use or disposal."
        }
      ]
    },
    {
      "clause": "3",
      "title": "Certificates",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "No person shall perform the functions of a certificate holder without first having obtained a certificate from the director designating the person as one or more of the following:",
          "certificate_types": [
            "A gas technician 1 (a \"G.1 certificate\")",
            "A gas technician 2 (a \"G.2 certificate\")",
            "A gas technician 3 (a \"G.3 certificate\")",
            "A gas piping fitter (a \"GP certificate\")",
            "A liquid propane fitter (an \"LP certificate\")",
            "An internal combustion alternate fuel technician (an \"ICE certificate\")",
            "An internal combustion alternate fuel technician-industrial equipment (an \"ICE-IE certificate\")",
            "A domestic appliance technician (a \"DA certificate\")",
            "A recreational vehicles technician 1 (an \"RV.1 certificate\")",
            "A recreational vehicles technician 2 (an \"RV.2 certificate\")",
            "An industrial maintenance technician (an \"IMT certificate\")",
            "A gas pipeline inspector (a \"GPI certificate\")",
            "A refuelling station installer-natural gas (a \"RSI-NG certificate\")",
            "A refuelling station service technician-natural gas (a \"RST-NG certificate\")",
            "A propane plant operator 1 (a \"PPO-1 certificate\")",
            "A propane plant operator 2 (a \"PPO-2 certificate\")",
            "A propane plant operator 3 (a \"PPO-3 certificate\")",
            "A propane cylinder inspector (a \"PCI certificate\")",
            "A propane truck operator (a \"PTO certificate\")",
            "An oil burner technician 1 (an \"OBT-1 certificate\")",
            "An oil burner technician 2 (an \"OBT-2 certificate\")",
            "An oil burner technician 3 (an \"OBT-3 certificate\")",
            "A fuel oil pipeline inspector (an \"OPI certificate\")",
            "An oil pipe fitter (an \"OP certificate\")",
            "A crop dryer technician (a \"CDT certificate\")",
            "An oil burner activation technician (an \"OBAT certificate\")",
            "A construction heater operator 1 (a \"CH-01 certificate\")",
            "A construction heater operator 2 (a \"CH-02 certificate\")",
            "A construction heater service and maintenance technician 1 (a \"CH-SM1 certificate\")",
            "A construction heater service and maintenance technician 2 (a \"CH-SM2 certificate\")",
            "A roofing equipment operator (an \"RE-O certificate\")",
            "A hydrogen fuel technician (an \"H2 certificate\")",
            "A gas utility technician 1 (a \"GUT-1 certificate\")",
            "A gas utility technician 2 (a \"GUT-2 certificate\")"
          ]
        },
        {
          "subsection": "(2)",
          "content": "A person may apply to the director to add one or more designations to his or her certificate."
        },
        {
          "subsection": "(3)",
          "content": "An application for a certificate or a renewal thereof shall be in the form published by the designated administrative authority and be accompanied by the fee set by the authority."
        },
        {
          "subsection": "(4)",
          "content": "A professional engineer within the meaning of the Professional Engineers Act shall be deemed,",
          "provisions": [
            "to hold a GPI certificate if he or she works in the field of natural gas distribution",
            "to hold an OPI certificate if he or she works in the field of fuel oil distribution"
          ]
        }
      ]
    },
    {
      "clause": "4",
      "title": "Expiry and renewal of certificates",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person who fails to renew his or her certificate before it expires shall not do any work under the certificate after the date of expiry."
        },
        {
          "subsection": "(2)",
          "content": "A certificate or renewal of a certificate expires on the date indicated on the certificate."
        },
        {
          "subsection": "(3)",
          "content": "An application for renewal of a certificate may be made before its date of expiry or within one year after it has expired."
        },
        {
          "subsection": "(4)",
          "content": "A person who applies for a renewal of a certificate before the date of expiry or within one year after the date of expiry shall successfully complete an upgrading course by the date specified by the director."
        },
        {
          "subsection": "(5)",
          "content": "An application for renewal of a certificate that is made one year or more after the expiry date shall be treated as a new application and all requirements relating to new applications apply."
        },
        {
          "subsection": "(6)",
          "content": "The addition of a designation to a certificate after the certificate is issued does not change the expiry date of the certificate."
        }
      ]
    },
    {
      "clause": "4.1",
      "title": "Accreditation of certain training providers",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "Training providers who are accredited by the director to provide training for a certificate or record of training required by Ontario Regulation 211/01 (Propane Storage and Handling), made under the Act, are deemed to have their accreditation expire on December 31, 2009."
        },
        {
          "subsection": "(2)",
          "content": "The director shall not approve or renew the accreditation of a training provider to provide training for a certificate or record of training required by Ontario Regulation 211/01, made under the Act, unless the training provider provides evidence acceptable to the director that the persons who will provide the training have subject matter and practical experience in the matters on which they will be providing training."
        },
        {
          "subsection": "(3)",
          "content": "The accreditation of a training provider to whom this section applies shall be valid for no more than three years."
        }
      ]
    },
    {
      "clause": "5",
      "title": "Qualifications",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "An applicant only qualifies for a certificate for which the applicant has successfully completed a program approved by the director that is conducted by an accredited training provider approved by the director and registered with the designated administrative authority."
        },
        {
          "subsection": "(2)",
          "content": "Subsection (1) does not apply where the director is satisfied that the applicant possesses knowledge and competence with respect to each designation sought by the applicant that is equivalent to the applicant having taken the program referred to in subsection (1)."
        },
        {
          "subsection": "(3)",
          "content": "An applicant referred to in subsection (1) may be issued a certificate only with respect to a designation sought by the applicant if the applicant first successfully completes an examination or a series of examinations conducted or approved by the director that demonstrates that the applicant possesses the necessary knowledge and competence for each designation sought by the applicant."
        },
        {
          "subsection": "(4)",
          "content": "If the applicant fails the examination or series of examinations on three successive attempts, the applicant shall successfully complete the program described in subsection (1) after making the unsuccessful attempts and before taking the examination or series of examinations again, and subsection (5) does not apply."
        },
        {
          "subsection": "(5)",
          "content": "An applicant is not required to comply with subsection (1) if the director is satisfied that the applicant possesses the necessary knowledge and competence with respect to each class of certificate sought by the applicant."
        }
      ]
    },
    {
      "clause": "6",
      "title": "Additional requirements for G.1 certificate",
      "subsections": [
        {
          "subsection": "",
          "content": "In addition to the requirements set out in section 5, an applicant for a G.1 certificate shall meet the following requirements:",
          "requirements": [
            "The applicant shall be the holder of a G.2 certificate when he or she applies",
            "The applicant shall have worked as a gas technician 2 within the scope of a G.2 certificate for at least two years or 4,000 hours of which at least 500 hours must have been on systems with an input greater than 400,000 Btuh, under the direct supervision of a person holding a G.1 certificate",
            "The applicant shall submit a completed declaration of work experience in a form acceptable to the director that sets out the nature of the experience the applicant acquired as the holder of a G.2 certificate during the period described in paragraph 2"
          ]
        }
      ]
    },
    {
      "clause": "7",
      "title": "Additional requirements for G.2 and DA certificates",
      "subsections": [
        {
          "subsection": "",
          "content": "In addition to the requirements set out in section 5, an applicant for a G.2 or DA certificate shall meet the following requirement:",
          "requirements": [
            "The applicant shall be the holder of a G.3 certificate or of a valid certificate of qualification as an operating engineer under Ontario Regulation 219/01 (Operating Engineers) when he or she applies"
          ]
        }
      ]
    },
    {
      "clause": "8",
      "title": "Additional requirements for RV.1 certificate",
      "subsections": [
        {
          "subsection": "",
          "content": "In addition to the requirements set out in section 5, an applicant for an RV.1 certificate shall meet the following requirements:",
          "requirements": [
            "The applicant shall be the holder of an RV.2 certificate when he or she applies",
            "The applicant shall have obtained at least six continuous months of documented work experience under the direct supervision of an RV.1 certificate holder"
          ]
        }
      ]
    },
    {
      "clause": "9",
      "title": "REVOKED",
      "subsections": [
        {
          "subsection": "",
          "content": "REVOKED: O. Reg. 253/08, s. 7."
        }
      ]
    },
    {
      "clause": "10",
      "title": "Additional requirements for IMT certificate",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "In addition to the requirements set out in section 5, an applicant for an IMT certificate shall meet the following requirements:",
          "requirements": [
            "The applicant shall be employed in an industrial or institutional establishment equipped with fuelled appliances or by a manufacturer of fuelled appliances",
            "The applicant shall have received training from an accredited training provider approved by the director for the work that a holder of an IMT certificate may carry out"
          ]
        },
        {
          "subsection": "(2)",
          "content": "The employer of an applicant for an IMT certificate shall maintain records of the training given to the applicant under paragraph 2 of subsection (1) and, upon request, shall give a copy of them to an inspector."
        },
        {
          "subsection": "(3)",
          "content": "An applicant for an IMT certificate who has successfully completed a training program approved by the director on the electrical components of the equipment as they relate to the gas and fuel oil systems only may be issued a certificate with the additional designation \"E\"."
        },
        {
          "subsection": "(4)",
          "content": "An applicant for an IMT certificate who has successfully completed a training program approved by the director on the mechanical components of the equipment only may be issued a certificate with the additional designation \"M\"."
        }
      ]
    },
    {
      "clause": "11",
      "title": "LP certificates",
      "subsections": [
        {
          "subsection": "",
          "content": "In addition to the requirements set out in section 5, an applicant for an LP certificate shall be the holder of a G.1, G.2, GP or IMT certificate."
        }
      ]
    },
    {
      "clause": "12",
      "title": "RSI-NG certificates",
      "subsections": [
        {
          "subsection": "",
          "content": "In addition to the requirements set out in section 5, an applicant for an RSI-NG certificate shall be the holder of a G.1 or G.2 certificate."
        }
      ]
    },
    {
      "clause": "12.1",
      "title": "Additional requirement for RST-NG certificate",
      "subsections": [
        {
          "subsection": "",
          "content": "In addition to the requirements set out in section 5, an applicant for an RST-NG certificate shall be the holder of a G.3 certificate."
        }
      ]
    },
    {
      "clause": "13",
      "title": "Additional requirements for ICE certificate",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "In addition to the requirements set out in section 5, an applicant for an ICE certificate shall meet the following requirements:",
          "requirements": [
            "At the time of applying, the applicant shall be the holder of a certificate of qualification issued under the Ontario College of Trades and Apprenticeship Act, 2009 that is not suspended and that authorizes the person to carry out work as an agricultural equipment technician, an automotive service technician, a fuel and electrical systems technician, a heavy duty equipment technician or a truck and coach technician",
            "The applicant shall have successfully completed a training program acceptable to the director on propane fuelling systems and gas fuelling systems"
          ]
        },
        {
          "subsection": "(2)",
          "content": "An applicant for an ICE-IE certificate shall have successfully completed a training program acceptable to the director on propane fuelling systems and gas fuelling systems."
        },
        {
          "subsection": "(3)",
          "content": "An applicant for an ICE or ICE-IE certificate who has successfully completed a training program on propane fuelling systems only may be issued a certificate with the additional designation \"P\" and such certificate entitles the holder to carry out work on propane fuelling systems only."
        },
        {
          "subsection": "(4)",
          "content": "An applicant for an ICE or ICE-IE certificate who has successfully completed a training program acceptable to the director in gas fuelling systems only may be issued a certificate with the additional designation \"G\" and such certificate entitles the holder to carry out work on gas fuelling systems only."
        }
      ]
    },
    {
      "clause": "14",
      "title": "Additional requirements for OBT-1 certificates",
      "subsections": [
        {
          "subsection": "",
          "content": "In addition to the requirements set out in section 5, an applicant for an OBT-1 certificate shall meet the following requirements:",
          "requirements": [
            "The applicant shall be the holder of an OBT-2 certificate when he or she applies",
            "The applicant shall have worked for at least 4,000 hours as an OBT-2 certificate holder of which at least 500 hours must have been on oil-fired systems with an input greater than 7 U.S. gallons per hour, under the direct supervision of a person holding an OBT-1 certificate",
            "The applicant shall submit a completed declaration of work experience in a form acceptable to the director that sets out the nature of the experience the applicant acquired as an OBT-2 certificate holder during the period described in paragraph 2"
          ]
        }
      ]
    },
    {
      "clause": "15",
      "title": "Additional requirements for OBT-2 certificate",
      "subsections": [
        {
          "subsection": "",
          "content": "In addition to the requirements set out in section 5, an applicant for an OBT-2 certificate shall meet the following requirement:",
          "requirements": [
            "The applicant shall be the holder of an OBT-3 certificate or a valid certificate of qualification as a first, second or third class operating engineer under Ontario Regulation 219/01 (Operating Engineers) when he or she applies"
          ]
        }
      ]
    },
    {
      "clause": "16",
      "title": "Additional requirements for an OP certificate",
      "subsections": [
        {
          "subsection": "",
          "content": "In addition to the requirements set out in section 5, an applicant for an OP certificate shall meet the following requirement:",
          "requirements": [
            "The applicant shall be the holder of a GP certificate or a gas technician certificate that allows the holder to conduct the work of a GP certificate holder"
          ]
        }
      ]
    },
    {
      "clause": "17",
      "title": "No transfer",
      "subsections": [
        {
          "subsection": "",
          "content": "A certificate is not transferable."
        }
      ]
    },
    {
      "clause": "18",
      "title": "REVOKED",
      "subsections": [
        {
          "subsection": "",
          "content": "REVOKED: O. Reg. 253/08, s. 13."
        }
      ]
    },
    {
      "clause": "19",
      "title": "Notice of change of address",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person who holds a certificate shall notify the director within 30 days after any change in his or her address."
        },
        {
          "subsection": "(2)",
          "content": "The director is not responsible for misdirected notices or renewals resulting from the certificate holder's failure to comply with subsection (1)."
        }
      ]
    },
    {
      "clause": "20",
      "title": "G.1 certificate",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person who is the holder of a G.1 certificate may install, inspect, alter, purge, activate, repair, service or remove a natural gas or propane appliance of any BTU input and the equipment and accessories essential to its operation."
        },
        {
          "subsection": "(2)",
          "content": "A person who is certified to carry out the functions described in subsection (1), may also do the following:",
          "functions": [
            "Install, inspect, test, alter, purge, activate, repair, service or remove any piping or tubing, or component in a piping or tubing system, to an appliance downstream of the natural gas meter or propane vapour service valve",
            "Install, inspect, alter, repair, service or remove any vent, vent connector, draft control device or other component in an appliance venting system",
            "Disconnect and reconnect water piping in order to exchange, service or install an approved appliance and carry out the replacement of water pipe necessary to complete the reconnection or installation of controls, control systems, components and accessories that are essential to the operation of the appliance, but the person shall not perform any additional plumbing unless he or she is the holder of a certificate of qualification in the trade of plumber or steamfitter, that is not suspended and that is issued under the Ontario College of Trades and Apprenticeship Act, 2009",
            "Maintain, service or replace a mechanical or electrical component or accessory that forms part of an appliance or that is essential to the operation of the appliance",
            "Perform such tasks as are necessary to replace controls and components that form part of an appliance",
            "Install, service, remove or replace components and accessories that form part of the gas-side of a refrigerating or air-conditioning unit, but the person shall not perform any work beyond the gas-side unless he or she is the holder of a certificate of qualification in the trade of refrigeration and air conditioning systems mechanic or residential air conditioning systems mechanic, that is not suspended and that is issued under the Ontario College of Trades and Apprenticeship Act, 2009",
            "Install, repair, service and maintain electrical wiring from an existing branch circuit containing overcurrent protection to appliances in order to exchange, service, repair or install an approved appliance and carry out the replacement of electrical wiring necessary to complete the reconnection or installation of controls, control systems, components and accessories that are essential to the operation of the appliance, but the person shall not run wiring back to the electrical supply panel or perform any additional wiring unless he or she is the holder of a certificate of qualification in the trade of electrician - construction and maintenance or electrician - domestic and rural, that is not suspended and that is issued under the Ontario College of Trades and Apprenticeship Act, 2009",
            "Install, repair, service, remove or replace the plenum connection or components forming part of the plenum connection in order to complete the installation of a natural gas or propane appliance, but the person shall not perform any sheet metal work beyond the plenum connection unless he or she is the holder of a certificate of qualification in the trade of residential (low rise) sheet metal installer or sheet metal worker, that is not suspended and that is issued under the Ontario College of Trades and Apprenticeship Act, 2009",
            "Service a flue where an oil appliance is vented through the same flue as a gas appliance",
            "Remove a fuel oil appliance, and the equipment and accessories, but not the aboveground storage tanks associated with the fuel oil appliance during a conversion of the fuel oil appliance from fuel oil to natural gas or propane gas"
          ]
        }
      ]
    },
    {
      "clause": "21",
      "title": "G.2 certificate",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person who is the holder of a G.2 certificate may install, inspect, alter, purge, activate, repair, service or remove a natural gas or propane appliance that has an input of 400,000 Btuh or less and the equipment and accessories essential to its operation."
        },
        {
          "subsection": "(2)",
          "content": "When performing a function described in subsection (1), the person may do the following:",
          "functions": [
            "Perform the functions described in paragraphs 1 to 10 of subsection 20 (2) that the holder of a G.1 certificate may perform",
            "Under the direct supervision of a person who is the holder of a G.1 certificate, perform all of the functions that fall within the scope of the supervising certificate holder's certificate"
          ]
        }
      ]
    },
    {
      "clause": "22",
      "title": "G.3 certificate",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person who is the holder of a G.3 certificate may, under the general supervision of a person who is the holder of a G.1, G.2 or DA certificate, carry out the following functions on a propane or natural gas appliance that fall within the scope of the supervising certificate holder's certificate, but only if the person has demonstrated the essential skills required to perform such work and has had that experience documented and signed-off by the supervising certificate holder in a form as set out and published by the director:",
          "functions": [
            "Install, test, activate or purge gas piping or tubing that is less than two and one-half inches in diameter or a component in a piping or tubing system to an appliance downstream of a natural gas meter or propane service valve up to an appliance control valve including the completion of the pressure test tag",
            "Reactivate a previously installed or converted appliance",
            "Clean and lubricate an appliance",
            "Clean, remove or replace a vent connector, venting or a draft control device"
          ]
        },
        {
          "subsection": "(2)",
          "content": "A person referred to in subsection (1) shall not perform the initial activation of a new appliance or a newly converted appliance."
        },
        {
          "subsection": "(3)",
          "content": "REVOKED: O. Reg. 253/08, s. 14 (2)."
        },
        {
          "subsection": "(4)",
          "content": "A person who is the holder of a G.3 certificate may, under the direct supervision of a person who is the holder of a G.1, G.2 or DA certificate, carry out any of the functions that fall within the scope of the supervising certificate holder's certificate."
        }
      ]
    },
    {
      "clause": "23",
      "title": "GPI certificate",
      "subsections": [
        {
          "subsection": "",
          "content": "A person who is the holder of a GPI certificate may, on behalf of an operating company, inspect and certify natural gas pipeline installations, tests and replacements in accordance with Ontario Regulation 210/01 (Oil and Gas Pipeline Systems)."
        }
      ]
    },
    {
      "clause": "24",
      "title": "RSI-NG certificate",
      "subsections": [
        {
          "subsection": "",
          "content": "A person who is the holder of a RSI-NG certificate may install, alter, service, maintain and repair natural gas vehicle refuelling stations."
        }
      ]
    },
    {
      "clause": "25",
      "title": "RST-NG certificate",
      "subsections": [
        {
          "subsection": "",
          "content": "A person who is the holder of a RST-NG certificate may alter, service, maintain and repair natural gas vehicle refuelling stations."
        }
      ]
    },
    {
      "clause": "26",
      "title": "LP certificate",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person who is the holder of an LP certificate may install, purge, activate, repair, alter, service and remove liquid propane piping or tubing systems and components."
        },
        {
          "subsection": "(2)",
          "content": "When performing a function described in subsection (1), the person may do the following:",
          "functions": [
            "Install, alter, purge and test valves, regulators or accessories that are connected to equipment or component downstream of the liquid outlet of the propane storage tank",
            "Disconnect and reconnect appliances and components in the liquid gas piping or tubing in order to carry out repairs to piping or tubing",
            "Connect liquid piping or tubing to newly-installed or replacement propane appliances or components"
          ]
        }
      ]
    },
    {
      "clause": "27",
      "title": "ICE certificate",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person who is the holder of an ICE certificate may install, purge, inspect, activate, repair, service and remove propane and gas fuelling equipment and systems on industrial vehicles and stationary engines mounted on vehicles and on motor vehicles within the meaning of the Highway Traffic Act."
        },
        {
          "subsection": "(2)",
          "content": "When performing a function described in subsection (1), the person may do the following:",
          "functions": [
            "Install, service and replace approved propane and gas fuelling engine components, tubing, hoses, tanks and other related equipment on vehicles and stationary engines that operate on gaseous fuels",
            "Purge and pressure test the related equipment and systems to ensure that they do not leak",
            "Adjust and calibrate propane and gas carburation systems",
            "Purge propane or gas containers and lines of air and moisture",
            "Conduct visual inspections of fuel tanks or cylinders and fuelling equipment for internal combustion engines on vehicles that are powered by propane or gas"
          ]
        }
      ]
    },
    {
      "clause": "28",
      "title": "ICE-IE certificate",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person who is the holder of an ICE-IE certificate may,",
          "functions": [
            "install, alter, purge, activate, repair, service or remove propane or gas fuelling equipment on stationary engines or internal combustion engines for mobile industrial equipment; and",
            "install, service or remove equipment, piping, tubing or hoses on mobile industrial equipment"
          ]
        },
        {
          "subsection": "(2)",
          "content": "When performing a function described in subsection (1), the person may do the following:",
          "functions": [
            "Install, service or replace approved propane or gas fuelling engine components, tubing, hoses, tanks and other related equipment for vehicles that operate on gaseous fuels",
            "Purge and pressure test the related equipment referred to in paragraph 1 and systems to ensure that they do not leak",
            "Purge propane or gas containers and lines of air and moisture",
            "Conduct visual inspections of fuel tanks or cylinders and fuelling equipment for internal combustion engines on mobile industrial equipment that are powered by propane or gas",
            "Adjust and calibrate propane and gas carburation systems"
          ]
        }
      ]
    },
    {
      "clause": "29",
      "title": "GP certificate",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person who is the holder of a GP certificate may,",
          "functions": [
            "install and repair pipe and tubing that supplies gas in a vapour state to an appliance; and",
            "alter, purge, test, repair, service or remove gas piping or tubing systems for natural gas and propane gas in the vapour state"
          ]
        },
        {
          "subsection": "(2)",
          "content": "When performing a function described in subsection (1), the person may do the following:",
          "functions": [
            "Install, alter, purge and test valves or regulators that are connected to an appliance downstream of the natural gas meter or propane vapour service valve",
            "Disconnect and reconnect appliances at the gas piping or tubing in order to carry out plumbing or steam repairs",
            "Connect gas piping or tubing to newly-installed or replacement natural gas or propane gas appliances",
            "Install venting"
          ]
        },
        {
          "subsection": "(3)",
          "content": "A person referred to in subsection (1) shall not weld piping or tubing unless he or she is qualified to do so under Ontario Regulation 220/01 (Boilers and Pressure Vessels) and does so in accordance with the procedures required by that regulation."
        }
      ]
    },
    {
      "clause": "30",
      "title": "IMT certificate",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person who is the holder of an IMT certificate may carry out work on the equipment for which the certificate is valid and perform any of the functions of a G.1 or OBT-1 certificate holder on which they have been trained, except the following work:",
          "exceptions": [
            "Install, service, remove or replace components and accessories that form part of a refrigerating or air-conditioning unit",
            "Install, service, remove or replace tanks"
          ]
        },
        {
          "subsection": "(2)",
          "content": "REVOKED: O. Reg. 253/08, s. 17."
        },
        {
          "subsection": "(3)",
          "content": "REVOKED: O. Reg. 253/08, s. 17."
        }
      ]
    },
    {
      "clause": "31",
      "title": "DA certificate",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person who is the holder of a DA certificate may install, alter, purge, activate, repair, service or remove any unvented residential natural gas or propane gas appliance and its equipment or a vented refrigerator that has an input of 100,000 Btuh or less, other than a construction heater."
        },
        {
          "subsection": "(2)",
          "content": "When performing a function described in subsection (1), the person may also do the following:",
          "functions": [
            "Install, test, inspect, activate, alter, purge, service, repair or remove any piping or tubing or component in a piping or tubing system to an unvented residential appliance or vented refrigerator downstream of the natural gas meter or propane vapour service valve",
            "Maintain, service or replace a mechanical or electrical component or moisture duct or accessory that forms part of an unvented residential appliance or vented refrigerator and that is essential to the appliance's operation",
            "Perform the tasks that are necessary to replace controls, components and accessories that form part of an unvented residential appliance or vented refrigerator and that are essential to the appliance's operation",
            "Service and replace electrical switches, fuses, components and control wiring that are directly related to the operation of an unvented residential appliance or vented refrigerator"
          ]
        },
        {
          "subsection": "(3)",
          "content": "A person referred to in subsection (1) shall not perform electrical work other than that described in subsection (2) unless he or she is the holder of a certificate of qualification in the trade of electrician - construction and maintenance or electrician - domestic and rural, that is not suspended and that is issued under the Ontario College of Trades and Apprenticeship Act, 2009."
        }
      ]
    },
    {
      "clause": "32",
      "title": "RV.1 certificate",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person who is the holder of an RV.1 certificate may install, alter, purge, activate, repair, service or remove any propane non-vented, direct vent or power vent appliance installed in a recreational vehicle, mobile home, office trailer or trailer that are not permanently located on a site or in an additional enclosure attached to any one of them with an input of 100,000 Btuh or less."
        },
        {
          "subsection": "(2)",
          "content": "When performing a function described in subsection (1), the person may also do the following:",
          "functions": [
            "Install, alter, purge, activate, test, service or remove regulators, accessories and tubing to supply the appliance",
            "Install, alter, purge, activate, test, service or remove any cylinders, regulators, accessories and tubing to supply the appliance",
            "Install a natural gas appliance provided that it is immediately converted to propane and the appliance is approved for the conversion to propane",
            "Replace, pressure and leak test a section of hard pipe that has been cut and threaded by a tradesperson referred to in paragraph 4 of subsection 3 (1)"
          ]
        },
        {
          "subsection": "(3)",
          "content": "A person referred to in subsection (2) shall not fill propane containers unless he or she holds the appropriate certificate or record of training as a propane plant operator referred to in paragraphs 15, 16 and 17 of subsection 3 (1)."
        }
      ]
    },
    {
      "clause": "33",
      "title": "RV.2 certificate",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person who is the holder of an RV.2 certificate may, under the general supervision of a holder of an RV.1 certificate, carry out any of the following functions that fall within the scope of the supervising certificate holder's certificate:",
          "functions": [
            "Relight appliances that have been operating in a satisfactory and safe condition",
            "Clean appliances in accordance with the manufacturer's instructions",
            "Remove and reconnect appliances",
            "Exchange cylinders but not fill them",
            "Conduct a leak test of the propane system of the appliance"
          ]
        },
        {
          "subsection": "(2)",
          "content": "The holder of an RV.2 certificate may also, under the direct supervision of a holder of an RV.1 certificate, carry out any of the functions that fall within the scope of the supervising certificate holder's certificate."
        }
      ]
    },
    {
      "clause": "34",
      "title": "PPO-1 certificate",
      "subsections": [
        {
          "subsection": "",
          "content": "A person may perform the following functions if the person is the holder of a PPO-1 certificate or is the holder of a record of training issued by an accredited training provider approved by the director that indicates that the person has taken training acceptable to the director:",
          "functions": [
            "Transfer propane to and from tank cars, cargo liners, tank trucks, filling plants and container refill centres",
            "Fill containers and operate propane transfer equipment in a filling plant or container refill centre"
          ]
        }
      ]
    },
    {
      "clause": "35",
      "title": "PPO-2 Certificate",
      "subsections": [
        {
          "subsection": "",
          "content": "A person may perform the following functions if the person is the holder of a PPO-2 certificate or is the holder of a record of training issued by an accredited training provider approved by the director that indicates that the person has taken training acceptable to the director:",
          "functions": [
            "Transfer propane to and from tank trucks, filling plants and container refill centres",
            "Fill containers and operate propane transfer equipment in a filling plant or container refill centre"
          ]
        }
      ]
    },
    {
      "clause": "36",
      "title": "PPO-3 certificate",
      "subsections": [
        {
          "subsection": "",
          "content": "A person may fill containers, including vehicle tanks, and operate propane transfer equipment in a filling plant or container refill centre if the person is the holder of a PPO-3 certificate or is the holder of a record of training issued by an accredited training provider approved by the director that indicates the person has taken training acceptable to the director."
        }
      ]
    },
    {
      "clause": "37",
      "title": "PCI certificate",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person may examine and requalify cylinders if the person is the holder of a PCI certificate or is the holder of an equivalent record of training issued by an accredited training provider approved by the director that indicates that the person has taken training acceptable to the director."
        },
        {
          "subsection": "(2)",
          "content": "In examining cylinders under subsection (1), the person shall follow the procedures described in the Transportation of Dangerous Goods Regulations made under the Transportation of Dangerous Goods Act, 1992 (Canada)."
        }
      ]
    },
    {
      "clause": "38",
      "title": "PTO certificate",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person may perform the following functions if the person is the holder of a PTO certificate or is the holder of a record of training issued by an accredited training provider approved by the director that indicates that the person has taken training acceptable to the director:",
          "functions": [
            "Operate a propane tank truck or a vehicle that tows a cargo liner",
            "Operate propane handling equipment in order to transfer propane to and from tank trucks, cargo liners, filling plants and container refill centres",
            "Fill containers on the premises of end-users",
            "Reactivate an existing customer's equipment in accordance with the manufacturer's lighting instructions in the event of loss of fuel supply"
          ]
        },
        {
          "subsection": "(2)",
          "content": "A person referred to in subsection (1) shall not perform initial activation of a new appliance or a newly converted appliance."
        }
      ]
    },
    {
      "clause": "39",
      "title": "OBT-1 certificate",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person who is the holder of an OBT-1 certificate may install, inspect, alter, purge, activate, repair, service or remove an oil-fired appliance and the accessories that form a part of the appliance assembly and that are essential to the operation of the appliance whether they are attached to the appliance directly or remotely."
        },
        {
          "subsection": "(2)",
          "content": "A person who is certified to carry out the functions described in subsection (1) may also do the following:",
          "functions": [
            "Install, repair, service, activate, remove or alter the piping or tubing supply system of an appliance or a component in the system",
            "Install, repair, service, activate, remove or alter any vent connector, draft control device or other component in an appliance venting system",
            "Disconnect and reconnect water piping in order to exchange, service or install an approved appliance and to carry out the replacement of water pipe necessary to complete the reconnection or installation of controls, control systems, components and accessories that are essential to the operation of the appliance, but the person shall not perform any additional plumbing unless the person is the holder of a certificate of qualification in the trade of plumber or steamfitter, that is not suspended and that is issued under the Ontario College of Trades and Apprenticeship Act, 2009",
            "Install, service, remove or replace components and accessories that form part of the fire-side of a refrigerating or air-conditioning unit, but the person shall not perform any work beyond the fire-side unless the person is the holder of a certificate of qualification in the trade of refrigeration and air conditioning systems mechanic or residential air conditioning systems mechanic, that is not suspended and that is issued under the Ontario College of Trades and Apprenticeship Act, 2009",
            "Maintain, service or replace a mechanical or electrical component or accessory that forms part of an appliance or system or that is essential to its operation, whether the components or accessories are attached to the appliance or system directly or remotely",
            "Perform the tasks that are necessary to replace controls and components that form part of an appliance or system and that are essential to the operation of the appliance or system, whether they are attached to it directly or remotely",
            "Install, repair, service and maintain electrical wiring from an existing branch circuit containing over current protection to appliances in order to exchange, service, repair or install an approved appliance and carry out the replacement of electrical wiring necessary to complete the reconnection or installation of controls, control systems, components and accessories that are essential to the operation of the appliance, but the person shall not run wiring back to the electrical supply panel or perform any additional wiring unless the person is a holder of a certificate of qualification in the trade of electrician - construction and maintenance or electrician - domestic and rural, that is not suspended and that is issued under the Ontario College of Trades and Apprenticeship Act, 2009",
            "Install, repair, service, remove or replace the plenum connection or components that form part of the plenum connection in order to complete the installation of an oil-fired appliance but the person shall not perform any sheet metal work beyond the plenum connection unless the person is the holder of a certificate of qualification in the trade of residential (low rise) sheet metal installer or sheet metal worker, that is not suspended and that is issued under the Ontario College of Trades and Apprenticeship Act, 2009",
            "Install, repair, alter, purge, service or remove aboveground tanks that have a capacity not greater than 5,000 litres",
            "Service a flue where an oil appliance is vented through the same flue as a gas appliance"
          ]
        }
      ]
    },
    {
      "clause": "40",
      "title": "OBT-2 certificate",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person who is the holder of an OBT-2 certificate may install, inspect, alter, purge, repair, activate, service or remove an oil-fired appliance that has an input not greater than 7 U.S. gallons per hour and the accessories that form a part of the appliance assembly and that are essential to the operation of the appliance whether they are attached to it directly or remotely."
        },
        {
          "subsection": "(2)",
          "content": "When performing a function described in subsection (1), the person may do the following:",
          "functions": [
            "Perform the functions described in paragraphs 1 to 10 of subsection 39 (2) that the holder of an OBT-1 certificate may perform",
            "Under the direct supervision of a holder of an OBT-1 certificate, perform all of the functions that fall within the scope of the supervising certificate holder's certificate"
          ]
        },
        {
          "subsection": "(3)",
          "content": "REVOKED: O. Reg. 253/08, s. 25 (2)."
        }
      ]
    },
    {
      "clause": "41",
      "title": "OBT-3 certificate",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person who is the holder of an OBT-3 certificate may, under the general supervision of a person who is the holder of an OBT-2 or OBT-1 certificate, carry out the following functions on an oil-fired appliance that has an input rate not greater than 2 U.S. gallons per hour but only if the person has demonstrated the essential skills required to perform such work and has had that experience documented and signed-off by the supervising certificate holder in a form as set out and published by the director:",
          "functions": [
            "Perform a comprehensive inspection",
            "Clean, remove and adjust a flue pipe or a barometric damper",
            "Clean, lubricate or perform maintenance on an appliance",
            "Conduct tests and adjustments necessary for the annual maintenance of the oil burner, controls or accessories that form part of the appliance assembly, whether attached to it directly or remotely, but shall not install, service, repair or remove an oil-fired appliance and the accessories that form part of the appliance assembly and that are essential to the operation of the appliance beyond that necessary for annual maintenance",
            "Install, activate or bleed oil piping or tubing that is less than two and one-half inches in diameter",
            "Reactivate a previously installed appliance"
          ]
        },
        {
          "subsection": "(2)",
          "content": "The person who is the holder of an OBT-3 certificate may, under the direct supervision of a person who is the holder of an OBT-1 or OBT-2 certificate, carry out any of the functions that fall within the scope of the supervising certificate holder's certificate."
        },
        {
          "subsection": "(3)",
          "content": "A person referred to in subsection (1) shall not perform the initial activation of a new appliance or a newly converted appliance."
        }
      ]
    },
    {
      "clause": "42",
      "title": "OPI certificate",
      "subsections": [
        {
          "subsection": "",
          "content": "A person who is the holder of an OPI certificate may examine a fuel oil pipeline to determine whether it complies with the requirements of this Regulation and Ontario Regulation 210/01 (Oil and Gas Pipeline Systems)."
        }
      ]
    },
    {
      "clause": "43",
      "title": "REVOKED",
      "subsections": [
        {
          "subsection": "",
          "content": "REVOKED: O. Reg. 253/08, s. 27."
        }
      ]
    },
    {
      "clause": "44",
      "title": "REVOKED",
      "subsections": [
        {
          "subsection": "",
          "content": "REVOKED: O. Reg. 253/08, s. 27."
        }
      ]
    },
    {
      "clause": "45",
      "title": "OP certificate",
      "subsections": [
        {
          "subsection": "",
          "content": "A person who holds an OP certificate may carry out the following functions:",
          "functions": [
            "Install and repair piping or tubing that supplies oil to an appliance of any input",
            "Alter, purge, test, repair, service or remove oil piping or tubing to an oil appliance",
            "Disconnect and reconnect appliances at the oil piping or tubing to carry out the necessary plumbing or steam repairs",
            "Connect oil piping or tubing to newly installed or replacement oil appliances"
          ]
        }
      ]
    },
    {
      "clause": "46",
      "title": "OBAT certificate",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person who holds an OBAT certificate may reactivate an oil-fired appliance with an input not greater than 7 U.S. gallons per hour and the accessories that form part of the appliance assembly, whether they are attached to it directly or remotely."
        },
        {
          "subsection": "(2)",
          "content": "When performing a function described in subsection (1), the person may do the following:",
          "functions": [
            "Replace the filters on the oil supply line to the appliance",
            "Bleed the oil pump or fuel unit",
            "Reactivate an existing customer's equipment in accordance with the manufacturer's lighting instructions in the event of loss of fuel supply"
          ]
        },
        {
          "subsection": "(3)",
          "content": "A person referred to in subsection (1) shall not perform the initial activation of a new appliance or a newly converted appliance."
        }
      ]
    },
    {
      "clause": "47",
      "title": "CH-01 certificate",
      "subsections": [
        {
          "subsection": "",
          "content": "A person who is the holder of a CH-01 certificate or the holder of a record of training for the purpose may activate a propane, natural gas or oil-fired construction heater or torch with an input of any Btuh, and connect it to or disconnect it from piping, tubing, a refuelling appliance, a container or a natural gas meter."
        }
      ]
    },
    {
      "clause": "48",
      "title": "CH-02 certificate",
      "subsections": [
        {
          "subsection": "",
          "content": "A person who is the holder of a CH-02 certificate or the holder of a record of training for the purpose may perform the functions of a CH-01 on a construction heater or torch that has an input of 400,000 Btuh or less."
        }
      ]
    },
    {
      "clause": "49",
      "title": "CH-SM1 certificate",
      "subsections": [
        {
          "subsection": "",
          "content": "A person who is the holder of a CH-SM1 certificate or the holder of a record of training for the purpose may service a propane, natural gas or oil-fired construction heater or torch with an input of any Btuh."
        }
      ]
    },
    {
      "clause": "50",
      "title": "CH-SM2 certificate",
      "subsections": [
        {
          "subsection": "",
          "content": "A person who is the holder of a CH-SM2 certificate or the holder of a record of training for the purpose may perform the functions of a CH-SM1 on a construction heater or torch that has an input of 400,000 Btuh or less."
        }
      ]
    },
    {
      "clause": "51",
      "title": "RE-O Certificate",
      "subsections": [
        {
          "subsection": "",
          "content": "A person who is the holder of an RE-O certificate or the holder of a record of training for the purpose may activate and operate a propane-fired tar pot heater with an input of any Btuh and connect it to or disconnect it from piping, tubing or a container."
        }
      ]
    },
    {
      "clause": "52",
      "title": "CDT certificate",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person who holds a CDT certificate may install, inspect, alter, purge, activate, repair, service or remove a natural gas or propane-fired agricultural crop drying appliance and the equipment and accessories essential to its operation."
        },
        {
          "subsection": "(2)",
          "content": "When performing a function described in subsection (1), the person may do the following:",
          "functions": [
            "Install, inspect, test, alter, purge, activate, repair, service or remove any piping or tubing, or component in a piping or a tubing system, to an agricultural crop drying appliance downstream of the natural gas meter or propane service valve",
            "Ensure safe installation, utilization, maintenance, repair or removal of agricultural crop drying equipment",
            "Maintain, service or replace a mechanical or electrical component or accessory forming part of an appliance or essential to its operation",
            "Perform the tasks that are necessary to replace controls and components forming part of an appliance",
            "Install, repair, service and maintain electrical wiring for natural gas or propane-fired appliances from an existing branch circuit containing over current protection, but shall not run wiring back to the panel or perform any other type of electrical work related to wiring of the appliance unless the person holds a certificate of qualification in the trade of electrician - construction and maintenance or electrician - domestic and rural, that is not suspended and that is issued under the Ontario College of Trades and Apprenticeship Act, 2009",
            "Service and replace electrical switches, fuses and components that are directly related to the operation of the agricultural crop drying appliance"
          ]
        },
        {
          "subsection": "(3)",
          "content": "Despite subsection (1), a holder of a CDT certificate is not permitted to activate initially equipment referred to in that subsection, unless the certificate holder has at least one year of work experience as a CDT certificate holder on such equipment."
        }
      ]
    },
    {
      "clause": "52.1",
      "title": "H2 certificate",
      "subsections": [
        {
          "subsection": "",
          "content": "A person who holds an H2 certificate may do the following:",
          "functions": [
            "Install, inspect, alter, purge, activate, repair, service or remove hydrogen appliances, equipment, tanks, components and accessories",
            "Install, inspect, purge, activate, repair, service or remove hydrogen fuelling equipment and systems on industrial vehicles and stationary engines mounted on vehicles and motor vehicles, as those expressions are defined in the Highway Traffic Act",
            "Install, alter, service, maintain or repair hydrogen vehicle refuelling stations"
          ]
        }
      ]
    },
    {
      "clause": "52.2",
      "title": "GUT-1 certificate",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person who is the holder of a GUT-1 certificate may inspect, test, adjust, purge or activate a natural gas appliance and the equipment and accessories essential to its operation but only during those hours that the certificate holder is working as an employee of a natural gas distributor."
        },
        {
          "subsection": "(2)",
          "content": "A person referred to in subsection (1) may also do the following:",
          "functions": [
            "Inspect, test, repair, adjust, alter, purge, activate or reactivate any piping or tubing, or component in a piping or tubing system, to an appliance downstream of the natural gas meter",
            "Inspect, test, repair, adjust, activate or reactivate any vent, vent connector, draft control device or other component in an appliance venting system",
            "Disconnect and reconnect water piping in order to inspect, test, adjust, activate or reactivate approved appliances or controls, control systems, components and accessories that are essential to the operation of the appliance, but the person shall not perform any additional plumbing unless the person is the holder of a certificate of qualification in the trade of plumber or steamfitter, that is not suspended and that is issued under the Ontario College of Trades and Apprenticeship Act, 2009",
            "Inspect, test, repair, adjust, activate or reactivate a mechanical or electrical component or accessory that forms part of an appliance or that is essential to the operation of the appliance",
            "Perform such tasks as are necessary to inspect, test, repair, replace and adjust controls and components that form part of an appliance",
            "Disconnect and reconnect electrical wiring in order to inspect, test, activate or reactivate an approved appliance and carry out the replacement of electrical wiring necessary to complete the reconnection of controls, control systems, components and accessories that are essential to the operation of the appliance; but the person shall not perform any additional wiring unless the person is the holder of a certificate of qualification in the trade of electrician - construction and maintenance or electrician - domestic and rural, that is not suspended and that is issued under the Ontario College of Trades and Apprenticeship Act, 2009",
            "Inspect a flue where an oil appliance is vented through the same flue as a gas appliance"
          ]
        },
        {
          "subsection": "(3)",
          "content": "A natural gas distributor who employs a holder of a GUT-1 certificate shall immediately advise the director when the certificate holder ceases to be employed by the distributor."
        }
      ]
    },
    {
      "clause": "52.3",
      "title": "GUT-2 certificate",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person who is the holder of a GUT-2 certificate may inspect, test, purge, activate or remove a natural gas appliance that has an input of 400,000 Btuh or less and the equipment and accessories essential to its operation but only during those hours that the certificate holder is working as an employee of a natural gas distributor."
        },
        {
          "subsection": "(2)",
          "content": "A person referred to in subsection (1) may also do the following:",
          "functions": [
            "Perform the functions described in paragraphs 1 to 7 of subsection 52.2 (2) that the holder of a GUT-1 certificate may perform on a natural gas appliance that has an input of 400,000 Btuh or less and the equipment and accessories essential to its operation",
            "Under the direct supervision of a person who is a holder of a GUT-1 certificate, perform all of the functions that fall within the scope of the supervising certificate holder's certificate as set out in this Regulation"
          ]
        },
        {
          "subsection": "(3)",
          "content": "A natural gas distributor who employs a holder of a GUT-2 certificate shall immediately advise the director when the certificate holder ceases to be employed by the distributor."
        }
      ]
    },
    {
      "clause": "53",
      "title": "Supervising certificate holder",
      "subsections": [
        {
          "subsection": "",
          "content": "A supervising certificate holder providing direct supervision to a person is responsible for the work of the supervised person."
        }
      ]
    },
    {
      "clause": "54",
      "title": "Record of training",
      "subsections": [
        {
          "subsection": "",
          "content": "A person holding a record of training is required to undergo either full retraining or skills retesting at three year intervals or, if the competence of the person is in question, at shorter intervals as set by the director."
        }
      ]
    },
    {
      "clause": "55",
      "title": "Exemptions",
      "subsections": [
        {
          "subsection": "(1)",
          "content": "A person is exempt from subsection 3 (1) with respect to the following activities:",
          "exemptions": [
            "Installing or servicing an appliance in a detached dwelling that is owned and occupied by the person but the person shall not activate a newly installed appliance until a person who is the holder of an appropriate certificate referred to in subsection 3 (1) determines that the appliance and its installation comply with the requirements of Ontario Regulation 212/01 (Gaseous Fuels) and Ontario Regulation 213/01 (Fuel Oil)",
            "Installing, activating or servicing a portable appliance for his or her own personal use provided that the appliance does not serve the public",
            "Reactivating an appliance, in accordance with the certified lighting instructions of its manufacturer, located in a detached dwelling that is owned and occupied by the person, if the appliance was initially installed and activated by a person who is the holder of an appropriate certificate referred to in subsection 3 (1), and if the appliance is maintained in a safe working condition",
            "If the person is the holder of a record of training, performing any work that is within the scope of work as set out in a PPO-1, PPO-2, PPO-3, PCI, PTO, CH-01, CH-02, CH-SM1, CH-SM2 or an RE-O certificate",
            "Constructing new propane or natural gas vehicles for an original equipment manufacturer of propane or natural gas vehicles on the manufacturer's premises",
            "Servicing, repairing or replacing any part of a propane or natural gas fuelled vehicle other than its propane or natural gas fuel system"
          ]
        },
        {
          "subsection": "(2)",
          "content": "An employee of a natural gas or propane distributor is exempt from subsection 3 (1) when shutting off the gas supply to or relighting appliances in a dwelling unit, and relighting appliances installed in a dwelling unit is exempt from subsection 3 (1) if the employee is under the general supervision of a holder of a G.1 or G.2 certificate and has received a training course approved by the director from his or her employer within the previous three years."
        },
        {
          "subsection": "(3)",
          "content": "A person who performs duct cleaning is exempt from subsection 3 (1) if, in doing so, the person does not work on any other part of the appliance except for the purpose of cleaning the fan."
        },
        {
          "subsection": "(4)",
          "content": "A person who holds a certificate as an operating engineer is exempt from subsection 3 (1) when performing work that is within the scope of the person's certificate on equipment that is located at a registered plant at which the person is employed."
        },
        {
          "subsection": "(5)",
          "content": "A person is exempt from subsection 3 (1) when assembling an appliance that a retailer has sold to a customer if,",
          "conditions": [
            "the appliance is a consumer product, as defined in section 2 of the Canada Consumer Product Safety Act (Canada), that is approved for sale and use under Ontario law",
            "the retailer is entitled to sell the appliance by its manufacturer",
            "the appliance is portable, is designed for outdoor use only and is not intended to be used to serve the public",
            "at the time of the sale, the retailer offers to have it assembled for the customer and the customer accepts the offer",
            "the person performing the assembly is an employee of the retailer or is an employee of the retailer's agent",
            "the person performing the assembly has completed a program of training on the assembly of the appliance provided by the retailer or the retailer's agent; and",
            "the assembly is completed in accordance with the assembly instructions of the manufacturer of the appliance"
          ]
        },
        {
          "subsection": "(6)",
          "content": "A person is exempt from the requirement in subsection 3 (1) to hold a PPO-1 certificate, PPO-2 certificate, PPO-3 certificate or record of training for the activity of refuelling a propane powered vehicle at a cardlock/keylock facility or a facility that is a private outlet if,",
          "conditions": [
            "the authorization holder for the facility provides training to the person at least once annually",
            "the training provided to the person is appropriate for the dispensing equipment and receiving equipment of the vehicle; and",
            "the authorization holder for the facility maintains a record of the training provided to the person"
          ]
        },
        {
          "subsection": "(7)",
          "content": "In subsection (6),",
          "definitions": [
            "\"cardlock/keylock facility\" means a facility not used by the general public where propane is dispensed unsupervised into a propane powered vehicle",
            "\"private outlet\" means any premises where propane is put into the fuel tanks of motor vehicles or into cylinders, but does not include any premises to which the public is invited and at which propane is sold"
          ]
        }
      ]
    }
  ]
}